{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "AM_General_Hummer_SUV_2000",
    "1": "Acura_Integra_Type_R_2001",
    "10": "Aston_Martin_Virage_Coupe_2012",
    "100": "Ferrari_458_Italia_Convertible_2012",
    "101": "Ferrari_458_Italia_Coupe_2012",
    "102": "Ferrari_California_Convertible_2012",
    "103": "Ferrari_FF_Coupe_2012",
    "104": "Fisker_Karma_Sedan_2012",
    "105": "Ford_E-Series_Wagon_Van_2012",
    "106": "Ford_Edge_SUV_2012",
    "107": "Ford_Expedition_EL_SUV_2009",
    "108": "Ford_F-150_Regular_Cab_2007",
    "109": "Ford_F-150_Regular_Cab_2012",
    "11": "Audi_100_Sedan_1994",
    "110": "Ford_F-450_Super_Duty_Crew_Cab_2012",
    "111": "Ford_Fiesta_Sedan_2012",
    "112": "Ford_Focus_Sedan_2007",
    "113": "Ford_Freestar_Minivan_2007",
    "114": "Ford_GT_Coupe_2006",
    "115": "Ford_Mustang_Convertible_2007",
    "116": "Ford_Ranger_SuperCab_2011",
    "117": "GMC_Acadia_SUV_2012",
    "118": "GMC_Canyon_Extended_Cab_2012",
    "119": "GMC_Savana_Van_2012",
    "12": "Audi_100_Wagon_1994",
    "120": "GMC_Terrain_SUV_2012",
    "121": "GMC_Yukon_Hybrid_SUV_2012",
    "122": "Geo_Metro_Convertible_1993",
    "123": "HUMMER_H2_SUT_Crew_Cab_2009",
    "124": "HUMMER_H3T_Crew_Cab_2010",
    "125": "Honda_Accord_Coupe_2012",
    "126": "Honda_Accord_Sedan_2012",
    "127": "Honda_Odyssey_Minivan_2007",
    "128": "Honda_Odyssey_Minivan_2012",
    "129": "Hyundai_Accent_Sedan_2012",
    "13": "Audi_A5_Coupe_2012",
    "130": "Hyundai_Azera_Sedan_2012",
    "131": "Hyundai_Elantra_Sedan_2007",
    "132": "Hyundai_Elantra_Touring_Hatchback_2012",
    "133": "Hyundai_Genesis_Sedan_2012",
    "134": "Hyundai_Santa_Fe_SUV_2012",
    "135": "Hyundai_Sonata_Hybrid_Sedan_2012",
    "136": "Hyundai_Sonata_Sedan_2012",
    "137": "Hyundai_Tucson_SUV_2012",
    "138": "Hyundai_Veloster_Hatchback_2012",
    "139": "Hyundai_Veracruz_SUV_2012",
    "14": "Audi_R8_Coupe_2012",
    "140": "Infiniti_G_Coupe_IPL_2012",
    "141": "Infiniti_QX56_SUV_2011",
    "142": "Isuzu_Ascender_SUV_2008",
    "143": "Jaguar_XK_XKR_2012",
    "144": "Jeep_Compass_SUV_2012",
    "145": "Jeep_Grand_Cherokee_SUV_2012",
    "146": "Jeep_Liberty_SUV_2012",
    "147": "Jeep_Patriot_SUV_2012",
    "148": "Jeep_Wrangler_SUV_2012",
    "149": "Lamborghini_Aventador_Coupe_2012",
    "15": "Audi_RS_4_Convertible_2008",
    "150": "Lamborghini_Diablo_Coupe_2001",
    "151": "Lamborghini_Gallardo_LP_570-4_Superleggera_2012",
    "152": "Lamborghini_Reventon_Coupe_2008",
    "153": "Land_Rover_LR2_SUV_2012",
    "154": "Land_Rover_Range_Rover_SUV_2012",
    "155": "Lincoln_Town_Car_Sedan_2011",
    "156": "MINI_Cooper_Roadster_Convertible_2012",
    "157": "Maybach_Landaulet_Convertible_2012",
    "158": "Mazda_Tribute_SUV_2011",
    "159": "McLaren_MP4-12C_Coupe_2012",
    "16": "Audi_S4_Sedan_2007",
    "160": "Mercedes-Benz_300-Class_Convertible_1993",
    "161": "Mercedes-Benz_C-Class_Sedan_2012",
    "162": "Mercedes-Benz_E-Class_Sedan_2012",
    "163": "Mercedes-Benz_S-Class_Sedan_2012",
    "164": "Mercedes-Benz_SL-Class_Coupe_2009",
    "165": "Mercedes-Benz_Sprinter_Van_2012",
    "166": "Mitsubishi_Lancer_Sedan_2012",
    "167": "Nissan_240SX_Coupe_1998",
    "168": "Nissan_Juke_Hatchback_2012",
    "169": "Nissan_Leaf_Hatchback_2012",
    "17": "Audi_S4_Sedan_2012",
    "170": "Nissan_NV_Passenger_Van_2012",
    "171": "Plymouth_Neon_Coupe_1999",
    "172": "Porsche_Panamera_Sedan_2012",
    "173": "Ram_C_V_Cargo_Van_Minivan_2012",
    "174": "Rolls-Royce_Ghost_Sedan_2012",
    "175": "Rolls-Royce_Phantom_Drophead_Coupe_Convertible_2012",
    "176": "Rolls-Royce_Phantom_Sedan_2012",
    "177": "Scion_xD_Hatchback_2012",
    "178": "Spyker_C8_Convertible_2009",
    "179": "Spyker_C8_Coupe_2009",
    "18": "Audi_S5_Convertible_2012",
    "180": "Suzuki_Aerio_Sedan_2007",
    "181": "Suzuki_Kizashi_Sedan_2012",
    "182": "Suzuki_SX4_Hatchback_2012",
    "183": "Suzuki_SX4_Sedan_2012",
    "184": "Tesla_Model_S_Sedan_2012",
    "185": "Toyota_4Runner_SUV_2012",
    "186": "Toyota_Camry_Sedan_2012",
    "187": "Toyota_Corolla_Sedan_2012",
    "188": "Toyota_Sequoia_SUV_2012",
    "189": "Volkswagen_Beetle_Hatchback_2012",
    "19": "Audi_S5_Coupe_2012",
    "190": "Volkswagen_Golf_Hatchback_1991",
    "191": "Volkswagen_Golf_Hatchback_2012",
    "192": "Volvo_240_Sedan_1993",
    "193": "Volvo_C30_Hatchback_2012",
    "194": "Volvo_XC90_SUV_2007",
    "195": "smart_fortwo_Convertible_2012",
    "2": "Acura_RL_Sedan_2012",
    "20": "Audi_S6_Sedan_2011",
    "21": "Audi_TTS_Coupe_2012",
    "22": "Audi_TT_Hatchback_2011",
    "23": "Audi_TT_RS_Coupe_2012",
    "24": "Audi_V8_Sedan_1994",
    "25": "BMW_1_Series_Convertible_2012",
    "26": "BMW_1_Series_Coupe_2012",
    "27": "BMW_3_Series_Sedan_2012",
    "28": "BMW_3_Series_Wagon_2012",
    "29": "BMW_6_Series_Convertible_2007",
    "3": "Acura_TL_Sedan_2012",
    "30": "BMW_ActiveHybrid_5_Sedan_2012",
    "31": "BMW_M3_Coupe_2012",
    "32": "BMW_M5_Sedan_2010",
    "33": "BMW_M6_Convertible_2010",
    "34": "BMW_X3_SUV_2012",
    "35": "BMW_X5_SUV_2007",
    "36": "BMW_X6_SUV_2012",
    "37": "BMW_Z4_Convertible_2012",
    "38": "Bentley_Arnage_Sedan_2009",
    "39": "Bentley_Continental_Flying_Spur_Sedan_2007",
    "4": "Acura_TL_Type-S_2008",
    "40": "Bentley_Continental_GT_Coupe_2007",
    "41": "Bentley_Continental_GT_Coupe_2012",
    "42": "Bentley_Continental_Supersports_Conv._Convertible_2012",
    "43": "Bentley_Mulsanne_Sedan_2011",
    "44": "Bugatti_Veyron_16.4_Convertible_2009",
    "45": "Bugatti_Veyron_16.4_Coupe_2009",
    "46": "Buick_Enclave_SUV_2012",
    "47": "Buick_Rainier_SUV_2007",
    "48": "Buick_Regal_GS_2012",
    "49": "Buick_Verano_Sedan_2012",
    "5": "Acura_TSX_Sedan_2012",
    "50": "Cadillac_CTS-V_Sedan_2012",
    "51": "Cadillac_Escalade_EXT_Crew_Cab_2007",
    "52": "Cadillac_SRX_SUV_2012",
    "53": "Chevrolet_Avalanche_Crew_Cab_2012",
    "54": "Chevrolet_Camaro_Convertible_2012",
    "55": "Chevrolet_Cobalt_SS_2010",
    "56": "Chevrolet_Corvette_Convertible_2012",
    "57": "Chevrolet_Corvette_Ron_Fellows_Edition_Z06_2007",
    "58": "Chevrolet_Corvette_ZR1_2012",
    "59": "Chevrolet_Express_Cargo_Van_2007",
    "6": "Acura_ZDX_Hatchback_2012",
    "60": "Chevrolet_Express_Van_2007",
    "61": "Chevrolet_HHR_SS_2010",
    "62": "Chevrolet_Impala_Sedan_2007",
    "63": "Chevrolet_Malibu_Hybrid_Sedan_2010",
    "64": "Chevrolet_Malibu_Sedan_2007",
    "65": "Chevrolet_Monte_Carlo_Coupe_2007",
    "66": "Chevrolet_Silverado_1500_Classic_Extended_Cab_2007",
    "67": "Chevrolet_Silverado_1500_Extended_Cab_2012",
    "68": "Chevrolet_Silverado_1500_Hybrid_Crew_Cab_2012",
    "69": "Chevrolet_Silverado_1500_Regular_Cab_2012",
    "7": "Aston_Martin_V8_Vantage_Convertible_2012",
    "70": "Chevrolet_Silverado_2500HD_Regular_Cab_2012",
    "71": "Chevrolet_Sonic_Sedan_2012",
    "72": "Chevrolet_Tahoe_Hybrid_SUV_2012",
    "73": "Chevrolet_TrailBlazer_SS_2009",
    "74": "Chevrolet_Traverse_SUV_2012",
    "75": "Chrysler_300_SRT-8_2010",
    "76": "Chrysler_Aspen_SUV_2009",
    "77": "Chrysler_Crossfire_Convertible_2008",
    "78": "Chrysler_PT_Cruiser_Convertible_2008",
    "79": "Chrysler_Sebring_Convertible_2010",
    "8": "Aston_Martin_V8_Vantage_Coupe_2012",
    "80": "Chrysler_Town_and_Country_Minivan_2012",
    "81": "Daewoo_Nubira_Wagon_2002",
    "82": "Dodge_Caliber_Wagon_2007",
    "83": "Dodge_Caliber_Wagon_2012",
    "84": "Dodge_Caravan_Minivan_1997",
    "85": "Dodge_Challenger_SRT8_2011",
    "86": "Dodge_Charger_SRT-8_2009",
    "87": "Dodge_Charger_Sedan_2012",
    "88": "Dodge_Dakota_Club_Cab_2007",
    "89": "Dodge_Dakota_Crew_Cab_2010",
    "9": "Aston_Martin_Virage_Convertible_2012",
    "90": "Dodge_Durango_SUV_2007",
    "91": "Dodge_Durango_SUV_2012",
    "92": "Dodge_Journey_SUV_2012",
    "93": "Dodge_Magnum_Wagon_2008",
    "94": "Dodge_Ram_Pickup_3500_Crew_Cab_2010",
    "95": "Dodge_Ram_Pickup_3500_Quad_Cab_2009",
    "96": "Dodge_Sprinter_Cargo_Van_2009",
    "97": "Eagle_Talon_Hatchback_1998",
    "98": "FIAT_500_Abarth_2012",
    "99": "FIAT_500_Convertible_2012"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AM_General_Hummer_SUV_2000": "0",
    "Acura_Integra_Type_R_2001": "1",
    "Acura_RL_Sedan_2012": "2",
    "Acura_TL_Sedan_2012": "3",
    "Acura_TL_Type-S_2008": "4",
    "Acura_TSX_Sedan_2012": "5",
    "Acura_ZDX_Hatchback_2012": "6",
    "Aston_Martin_V8_Vantage_Convertible_2012": "7",
    "Aston_Martin_V8_Vantage_Coupe_2012": "8",
    "Aston_Martin_Virage_Convertible_2012": "9",
    "Aston_Martin_Virage_Coupe_2012": "10",
    "Audi_100_Sedan_1994": "11",
    "Audi_100_Wagon_1994": "12",
    "Audi_A5_Coupe_2012": "13",
    "Audi_R8_Coupe_2012": "14",
    "Audi_RS_4_Convertible_2008": "15",
    "Audi_S4_Sedan_2007": "16",
    "Audi_S4_Sedan_2012": "17",
    "Audi_S5_Convertible_2012": "18",
    "Audi_S5_Coupe_2012": "19",
    "Audi_S6_Sedan_2011": "20",
    "Audi_TTS_Coupe_2012": "21",
    "Audi_TT_Hatchback_2011": "22",
    "Audi_TT_RS_Coupe_2012": "23",
    "Audi_V8_Sedan_1994": "24",
    "BMW_1_Series_Convertible_2012": "25",
    "BMW_1_Series_Coupe_2012": "26",
    "BMW_3_Series_Sedan_2012": "27",
    "BMW_3_Series_Wagon_2012": "28",
    "BMW_6_Series_Convertible_2007": "29",
    "BMW_ActiveHybrid_5_Sedan_2012": "30",
    "BMW_M3_Coupe_2012": "31",
    "BMW_M5_Sedan_2010": "32",
    "BMW_M6_Convertible_2010": "33",
    "BMW_X3_SUV_2012": "34",
    "BMW_X5_SUV_2007": "35",
    "BMW_X6_SUV_2012": "36",
    "BMW_Z4_Convertible_2012": "37",
    "Bentley_Arnage_Sedan_2009": "38",
    "Bentley_Continental_Flying_Spur_Sedan_2007": "39",
    "Bentley_Continental_GT_Coupe_2007": "40",
    "Bentley_Continental_GT_Coupe_2012": "41",
    "Bentley_Continental_Supersports_Conv._Convertible_2012": "42",
    "Bentley_Mulsanne_Sedan_2011": "43",
    "Bugatti_Veyron_16.4_Convertible_2009": "44",
    "Bugatti_Veyron_16.4_Coupe_2009": "45",
    "Buick_Enclave_SUV_2012": "46",
    "Buick_Rainier_SUV_2007": "47",
    "Buick_Regal_GS_2012": "48",
    "Buick_Verano_Sedan_2012": "49",
    "Cadillac_CTS-V_Sedan_2012": "50",
    "Cadillac_Escalade_EXT_Crew_Cab_2007": "51",
    "Cadillac_SRX_SUV_2012": "52",
    "Chevrolet_Avalanche_Crew_Cab_2012": "53",
    "Chevrolet_Camaro_Convertible_2012": "54",
    "Chevrolet_Cobalt_SS_2010": "55",
    "Chevrolet_Corvette_Convertible_2012": "56",
    "Chevrolet_Corvette_Ron_Fellows_Edition_Z06_2007": "57",
    "Chevrolet_Corvette_ZR1_2012": "58",
    "Chevrolet_Express_Cargo_Van_2007": "59",
    "Chevrolet_Express_Van_2007": "60",
    "Chevrolet_HHR_SS_2010": "61",
    "Chevrolet_Impala_Sedan_2007": "62",
    "Chevrolet_Malibu_Hybrid_Sedan_2010": "63",
    "Chevrolet_Malibu_Sedan_2007": "64",
    "Chevrolet_Monte_Carlo_Coupe_2007": "65",
    "Chevrolet_Silverado_1500_Classic_Extended_Cab_2007": "66",
    "Chevrolet_Silverado_1500_Extended_Cab_2012": "67",
    "Chevrolet_Silverado_1500_Hybrid_Crew_Cab_2012": "68",
    "Chevrolet_Silverado_1500_Regular_Cab_2012": "69",
    "Chevrolet_Silverado_2500HD_Regular_Cab_2012": "70",
    "Chevrolet_Sonic_Sedan_2012": "71",
    "Chevrolet_Tahoe_Hybrid_SUV_2012": "72",
    "Chevrolet_TrailBlazer_SS_2009": "73",
    "Chevrolet_Traverse_SUV_2012": "74",
    "Chrysler_300_SRT-8_2010": "75",
    "Chrysler_Aspen_SUV_2009": "76",
    "Chrysler_Crossfire_Convertible_2008": "77",
    "Chrysler_PT_Cruiser_Convertible_2008": "78",
    "Chrysler_Sebring_Convertible_2010": "79",
    "Chrysler_Town_and_Country_Minivan_2012": "80",
    "Daewoo_Nubira_Wagon_2002": "81",
    "Dodge_Caliber_Wagon_2007": "82",
    "Dodge_Caliber_Wagon_2012": "83",
    "Dodge_Caravan_Minivan_1997": "84",
    "Dodge_Challenger_SRT8_2011": "85",
    "Dodge_Charger_SRT-8_2009": "86",
    "Dodge_Charger_Sedan_2012": "87",
    "Dodge_Dakota_Club_Cab_2007": "88",
    "Dodge_Dakota_Crew_Cab_2010": "89",
    "Dodge_Durango_SUV_2007": "90",
    "Dodge_Durango_SUV_2012": "91",
    "Dodge_Journey_SUV_2012": "92",
    "Dodge_Magnum_Wagon_2008": "93",
    "Dodge_Ram_Pickup_3500_Crew_Cab_2010": "94",
    "Dodge_Ram_Pickup_3500_Quad_Cab_2009": "95",
    "Dodge_Sprinter_Cargo_Van_2009": "96",
    "Eagle_Talon_Hatchback_1998": "97",
    "FIAT_500_Abarth_2012": "98",
    "FIAT_500_Convertible_2012": "99",
    "Ferrari_458_Italia_Convertible_2012": "100",
    "Ferrari_458_Italia_Coupe_2012": "101",
    "Ferrari_California_Convertible_2012": "102",
    "Ferrari_FF_Coupe_2012": "103",
    "Fisker_Karma_Sedan_2012": "104",
    "Ford_E-Series_Wagon_Van_2012": "105",
    "Ford_Edge_SUV_2012": "106",
    "Ford_Expedition_EL_SUV_2009": "107",
    "Ford_F-150_Regular_Cab_2007": "108",
    "Ford_F-150_Regular_Cab_2012": "109",
    "Ford_F-450_Super_Duty_Crew_Cab_2012": "110",
    "Ford_Fiesta_Sedan_2012": "111",
    "Ford_Focus_Sedan_2007": "112",
    "Ford_Freestar_Minivan_2007": "113",
    "Ford_GT_Coupe_2006": "114",
    "Ford_Mustang_Convertible_2007": "115",
    "Ford_Ranger_SuperCab_2011": "116",
    "GMC_Acadia_SUV_2012": "117",
    "GMC_Canyon_Extended_Cab_2012": "118",
    "GMC_Savana_Van_2012": "119",
    "GMC_Terrain_SUV_2012": "120",
    "GMC_Yukon_Hybrid_SUV_2012": "121",
    "Geo_Metro_Convertible_1993": "122",
    "HUMMER_H2_SUT_Crew_Cab_2009": "123",
    "HUMMER_H3T_Crew_Cab_2010": "124",
    "Honda_Accord_Coupe_2012": "125",
    "Honda_Accord_Sedan_2012": "126",
    "Honda_Odyssey_Minivan_2007": "127",
    "Honda_Odyssey_Minivan_2012": "128",
    "Hyundai_Accent_Sedan_2012": "129",
    "Hyundai_Azera_Sedan_2012": "130",
    "Hyundai_Elantra_Sedan_2007": "131",
    "Hyundai_Elantra_Touring_Hatchback_2012": "132",
    "Hyundai_Genesis_Sedan_2012": "133",
    "Hyundai_Santa_Fe_SUV_2012": "134",
    "Hyundai_Sonata_Hybrid_Sedan_2012": "135",
    "Hyundai_Sonata_Sedan_2012": "136",
    "Hyundai_Tucson_SUV_2012": "137",
    "Hyundai_Veloster_Hatchback_2012": "138",
    "Hyundai_Veracruz_SUV_2012": "139",
    "Infiniti_G_Coupe_IPL_2012": "140",
    "Infiniti_QX56_SUV_2011": "141",
    "Isuzu_Ascender_SUV_2008": "142",
    "Jaguar_XK_XKR_2012": "143",
    "Jeep_Compass_SUV_2012": "144",
    "Jeep_Grand_Cherokee_SUV_2012": "145",
    "Jeep_Liberty_SUV_2012": "146",
    "Jeep_Patriot_SUV_2012": "147",
    "Jeep_Wrangler_SUV_2012": "148",
    "Lamborghini_Aventador_Coupe_2012": "149",
    "Lamborghini_Diablo_Coupe_2001": "150",
    "Lamborghini_Gallardo_LP_570-4_Superleggera_2012": "151",
    "Lamborghini_Reventon_Coupe_2008": "152",
    "Land_Rover_LR2_SUV_2012": "153",
    "Land_Rover_Range_Rover_SUV_2012": "154",
    "Lincoln_Town_Car_Sedan_2011": "155",
    "MINI_Cooper_Roadster_Convertible_2012": "156",
    "Maybach_Landaulet_Convertible_2012": "157",
    "Mazda_Tribute_SUV_2011": "158",
    "McLaren_MP4-12C_Coupe_2012": "159",
    "Mercedes-Benz_300-Class_Convertible_1993": "160",
    "Mercedes-Benz_C-Class_Sedan_2012": "161",
    "Mercedes-Benz_E-Class_Sedan_2012": "162",
    "Mercedes-Benz_S-Class_Sedan_2012": "163",
    "Mercedes-Benz_SL-Class_Coupe_2009": "164",
    "Mercedes-Benz_Sprinter_Van_2012": "165",
    "Mitsubishi_Lancer_Sedan_2012": "166",
    "Nissan_240SX_Coupe_1998": "167",
    "Nissan_Juke_Hatchback_2012": "168",
    "Nissan_Leaf_Hatchback_2012": "169",
    "Nissan_NV_Passenger_Van_2012": "170",
    "Plymouth_Neon_Coupe_1999": "171",
    "Porsche_Panamera_Sedan_2012": "172",
    "Ram_C_V_Cargo_Van_Minivan_2012": "173",
    "Rolls-Royce_Ghost_Sedan_2012": "174",
    "Rolls-Royce_Phantom_Drophead_Coupe_Convertible_2012": "175",
    "Rolls-Royce_Phantom_Sedan_2012": "176",
    "Scion_xD_Hatchback_2012": "177",
    "Spyker_C8_Convertible_2009": "178",
    "Spyker_C8_Coupe_2009": "179",
    "Suzuki_Aerio_Sedan_2007": "180",
    "Suzuki_Kizashi_Sedan_2012": "181",
    "Suzuki_SX4_Hatchback_2012": "182",
    "Suzuki_SX4_Sedan_2012": "183",
    "Tesla_Model_S_Sedan_2012": "184",
    "Toyota_4Runner_SUV_2012": "185",
    "Toyota_Camry_Sedan_2012": "186",
    "Toyota_Corolla_Sedan_2012": "187",
    "Toyota_Sequoia_SUV_2012": "188",
    "Volkswagen_Beetle_Hatchback_2012": "189",
    "Volkswagen_Golf_Hatchback_1991": "190",
    "Volkswagen_Golf_Hatchback_2012": "191",
    "Volvo_240_Sedan_1993": "192",
    "Volvo_C30_Hatchback_2012": "193",
    "Volvo_XC90_SUV_2007": "194",
    "smart_fortwo_Convertible_2012": "195"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.15.0"
}
